{
  "APP_SETTINGS": {
    "LICENSE_COMPANY": "MISSING", // Licensed company for this specific MTE library.
    "LICENSE_KEY": "MISSING", // License key for your library
    "UPSTREAM": "MISSING", // The URL of the server that handles the incoming request on behalf of the client
    "CLIENT_ID_SECRET": "MISSING", // Used to aid in "signing" the client id.  
    "CORS_ORIGINS": "MISSING", // Comma separated list of allowed origins into the Mte-Relay. 
    "OUTBOUND_TOKEN": "E75944429588427E97A8E038999A6FDE", // If present, this can serve as a FrontEnd proxy and incoming requests must have the x-mtte-outbound-token header.
    "PASS_THROUGH_ROUTES": "/favicon.ico, /health, /version", // Requests to these routes will be passed through with no protection from MTE.      
    "MAX_POOL_SIZE": 250, // Number of empty Mte Encoders and Decoders to initially set up.
    "CORS_METHODS": "GET,POST,PUT,PATCH,DELETE", // Comma separated list of the Http Methods that CORS will allow (HEAD and OPTIONS are always allowed).
    "CORS_ALLOWED_HEADERS": "x-auth-token", // These header keys will be allowed by the CORS request.
    "MTERELAY_USER_AGENT": ".Net MTE-Relay", // If the incoming request has no User-Agent, use this value.
    "APP_LOG_LEVEL": "Warning", // Set the log level for Eclypses messages to Warning, Info, Debug, or Verbose
    "SYS_LOG_LEVEL": "Warning", // Set the log level for system messages to Warning, Info, Debug, or Verbose
    "LOG_FILE": "", // If blank or missing, no logs are written to a file, they are only written to the console.
    "PORT": 8080, // The port that the Mte-Relay server is listening on.
    "NUMBER_OF_MTE_RELAY_SERVER_PAIRS": 15, // Number of pairs with an OUTBOUND Mte-Relay server
    "TIMEOUT_SECONDS": 120, // Number of seconds before a timeout is thrown. (if 0, timeouts are disabled)
    "MTE_CHUNK_SIZE": 16384, // Size of a single chunk that Mte will encode or decode. (Recommended is 16K)
    "CACHE_PROVIDER": "redis", // Determines the State Caching provider - memory or redis
    "CACHE_SLIDING_EXPIRATION_MINUTES": 15, // Number of minutes that a "cached" MTE State will stay alive (this is a sliding expiration). (Default is 15)
    "REDIS_CONNECTION_STRING": "MISSING", // If we are using Redis for caching, this is the connection string.
    "REDIS_INSTANCE_NAME": "MteRelayCache" // If we are using Redis for caching, this is the instance name.
  },
  "AllowedHosts": "*"
}